k= int(input('ввести 1 вертикаль:'))#Ввод
while(k<1 or k>8):
    k= int(input('ввести 1 вертикаль:'))#Ввод
l= int(input('ввести 1 горизонталь:'))#Ввод
while(l<1 or l>8):
    l= int(input('ввести 1 горизонталь:'))#Ввод
m= int(input('ввести 2 вертикаль:'))#Ввод
while(m<1 or m>8):
    m= int(input('ввести 2 вертикаль:'))#Ввод
n= int(input('ввести 2 горизонталь:'))#Ввод
while(n<1 or n>8):
    n= int(input('ввести 2 горизонталь:'))#Ввод
print("(",k,",",l,")")
print("(",m,",",n,")")





#Проверка цвета
q=0
w=0

if(k%2==1):
    if(l%2==1):#
        q=1
    else:
        q=0
else:
    if(l%2==1):
        q=0
    else:
        q=1
    
if(m%2==1):
    if(n%2==1):
        w=1
    else:
        w=0
else:
    if(n%2==1):
        w=0
    else:
        w=1
if(w==q):
    print("одного цвета")
else:
    print("разного цвета")











#Угроза ферзя
e=0
if(k==m or l==n):#проверка на вертикаль горизонталь
    e=1
else:
    a=k
    s=l
    while(a!=1 and s!=1):#перебор клеток диагонали
        a-=1
        s-=1
        if(a==m and s==n):
            e=1
    while(a!=8 and s!=8):#перебор клеток диагонали в другую сторону
        a+=1
        s+=1
        if(a==m and s==n):
            e=1
            
    a=k

    s=l

    while(a!=1 and s!=8):#перебор клеток другой диагонали
        a-=1

        s+=1

        if(a==m and s==n):
            e=1
    while(a!=8 and s!=1):
        a+=1
        s-=1
        if(a==m and s==n):
            e=1
            
if(e==1):#вывод
    print("ферзь ","(",k,",",l,") ","угрожает ","(",m,",",n,")")
else:
    print("ферзь ","(",k,",",l,") ","не угрожает ","(",m,",",n,")")
    


#Угроза коня
if(((abs(k-m)==2)and(abs(l-n)==1))or((abs(k-m)==1)and(abs(l-n)==2))):
   print("конь ","(",k,",",l,") ","угрожает ","(",m,",",n,")")
else:
    print("конь ","(",k,",",l,") ","не угрожает ","(",m,",",n,")")




#Ходы ладьи
if(k==m or l==n):
    print("Ладья ","(",k,",",l,") ","попадет на ","(",m,",",n,") за 1 ход")
else:
    print("Ладья ","(",k,",",l,") ","попадет на ","(",m,",",n,") за 2 хода через""(",k,",",n,") ","или ","(",m,",",l,")")









#Ходы ферзя    
if(e==1):
    print("Ферзь ","(",k,",",l,") ","попадет на ","(",m,",",n,") за 1 ход")#если угрожает, то попадет за 1 ход
else:

    print("Ферзь ","(",k,",",l,") ","попадет на ","(",m,",",n,") за 2 хода через")
    print("(",k,",",n,")\n(",m,",",l,") ")
    a=k
    s=l
    while(a!=1 and s!=1):#перебор клеток диагонали для 2 хода по горизонтали
        a-=1
        s-=1
        if(a==m or s==n):#если совпадает вертикаль или горизонталь, то по ней можно попасть на нужную клетку
            print("(",a,",",s,")")
    while(a!=8 and s!=8):
        a+=1
        s+=1
        if(a==m or s==n):
            print("(",a,",",s,")")
            
    a=k #перебор клеток диагонали для 2 хода по диагонали

    s=l

    while(a!=1 and s!=8):
        a-=1

        s+=1

        if(a==m or s==n):
            print("(",a,",",s,")")
    while(a!=8 and s!=1):
        a+=1
        s-=1
        if(a==m or s==n):
            print("(",a,",",s,")")
    a=k
    s=l
    while(a!=0 and s!=0):#опускаем в левый нижний угол
        a-=1
        s-=1

    while(a!=9 and s!=9):#поднимаемся, перебирая диагонали
        t=a
        y=s
        while(t!=0 and y!=9):
            t-=1
            y+=1

        while(t!=9 and y!=0):
            
            if(t==m and y==n):
                print("(",a,",",s,")")
            t+=1
            y-=1
       
            
        a+=1
        s+=1

    
    a=k
    s=l

    while(a!=0 and s!=9):
        a-=1

        s+=1

    while(a!=9 and s!=0):
        t=a
        y=s
        while(t!=0 and y!=0):
            t-=1
            y-=1
        while(t!=9 and y!=9):
            
            if(t==m and y==n):
                print("(",a,",",s,")")
            t+=1
            y+=1
        a+=1
        s-=1
            
            
            
            
            
            
            
            
            
#ходы слона
if(w!=q):
    print("Слон ","(",k,",",l,") ","не попадет на ","(",m,",",n,")")#если разный цвет, то не попадет

while(w==q):
    if(k==m and l==n):
        print("Слон ","(",k,",",l,") ","попадет на ","(",m,",",n,") за 0 ход")
        break
    e=0#проверка 1 хода
    a=k
    s=l
    while(a!=1 and s!=1):#перебор диагоналей
        a-=1
        s-=1
        if(a==m and s==n):
            e=1
    while(a!=8 and s!=8):
        a+=1
        s+=1
        if(a==m and s==n):
            e=1
            
    a=k

    s=l

    while(a!=1 and s!=8):
        a-=1

        s+=1

        if(a==m and s==n):
            e=1
    while(a!=8 and s!=1):
        a+=1
        s-=1
        if(a==m and s==n):
            e=1
            
    if e==1:
      print("Слон ","(",k,",",l,") ","попадет на ","(",m,",",n,") за 1 ход")
      break
  
    print("Слон ","(",k,",",l,") ","попадет на ","(",m,",",n,") за 2 ходa")
    a=k#проверка 2 ходов
    s=l
    while(a!=0 and s!=0):#опускаем в левый нижний угол
        a-=1
        s-=1

    while(a!=9 and s!=9):#поднимаемся вправо, перебирая диагонали
        t=a
        y=s
        while(t!=0 and y!=9):
            t-=1
            y+=1

        while(t!=9 and y!=0):
            
            if(t==m and y==n):
                print("через","(",a,",",s,")")
            t+=1
            y-=1
       
            
        a+=1
        s+=1

    
    a=k
    s=l

    while(a!=0 and s!=9):
        a-=1

        s+=1

    while(a!=9 and s!=0):#поднимаемся влево, перебирая диагонали
        t=a
        y=s
        while(t!=0 and y!=0):
            t-=1
            y-=1
        while(t!=9 and y!=9):
            
            if(t==m and y==n):
                print("через","(",a,",",s,")")
            t+=1
            y+=1
        a+=1
        s-=1
    break
            
k= int(input())#заглушка